app/Modules/Admin/Dashboard/Models/DashboardModel.php

  function get_target($param=[]){
    $tahun = $param['tahun'];
    $data = $this->db->table("jenis_pajak")->select("*")->get()->getResultArray();
    foreach($data as $index_anggaran=>$jenis){
        $bulan = $this->db->table("ref_anggaran")
          ->select("bulan,tahun,status_anggaran")
          ->where("tahun",$tahun)
          ->get()->getResult();
        foreach($bulan as $val_bulan){
          $target = $this->db->table("target")
            ->where("bulan",$val_bulan->bulan)
            ->where("tahun",$val_bulan->tahun)
            ->where("jenis_id",$jenis['id'])
            ->where("tahun",$tahun)
            ->get()->getRow();
---
SELECT *
FROM `jenis_pajak`
SELECT `bulan`, `tahun`, `status_anggaran`
FROM `ref_anggaran`
WHERE `tahun` = '2026'
SELECT *
FROM `target`
WHERE `bulan` = '1'
AND `tahun` = '2026'
AND `jenis_id` = '1'
AND `tahun` = '2026'