app/Modules/Admin/Detil/Models/DetilModel.php

    public function getKecamatan()
    {
        return $this->db
            ->table('kecamatan')
            ->orderBy('nama_kecamatan', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `kecamatan`
ORDER BY `nama_kecamatan` ASC

    public function getDesa($kodeKecamatan = null)
    {
        $builder = $this->db
            ->table('desa d')
            ->select('d.kode_desa, d.kode_desa_pbb, d.kode_kecamatan, d.nama_desa')
            ->orderBy('d.nama_desa', 'ASC');

        if (!empty($kodeKecamatan)) {
            $builder->where('d.kode_kecamatan', $kodeKecamatan);
        }

        return $builder->get()->getResultArray();
---
SELECT `d`.`kode_desa`, `d`.`kode_desa_pbb`, `d`.`kode_kecamatan`, `d`.`nama_desa`
FROM `desa` `d`
WHERE `d`.`kode_kecamatan` = '330802'
ORDER BY `d`.`nama_desa` ASC

    public function getJenisPajak()
    {
        return $this->db
            ->table('jenis_pajak')
            ->whereIn('jenis', ['pbb', 'nonpbb', 'kendaraan'])
            ->orderBy('nama_pajak', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `jenis_pajak`
WHERE `jenis` IN ('pbb','nonpbb','kendaraan')
ORDER BY `nama_pajak` ASC