app/Helpers/security_helper.php


        #----lolos sampai sini brarti valid, bikin session (admin,master,pimpinan)
        $db   = \Config\Database::connect();
        $cek  = $db->table("users")->where("uuid",$decode->uuid)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `uuid` = '5b65dc54-f8fd-48f4-80c3-cc9af9f4884d'

          unset($data_user_slo['uuid']);
          unset($data_user_slo['aktif']);

          $db->table("users")->where("id",$id)->update($data_user_slo);
        }

        $data_user =  $db->table("users")->where("uuid",$decode->uuid)->get()->getRowArray();
---
UPDATE `users` SET `nohp` = '%2Bfzx8%2Bw3Cy8dAvY1', `email` = 'LCwdKu42DjMZDCtgaB4lRV0uJlstAGI4Kmxi', `email_gov` = '', `nama_user` = 'FiUqLy5y%2Bj5OLSxgZyI%3D', `role` = 'sijaka_admin'
WHERE `id` = '1'
SELECT *
FROM `users`
WHERE `uuid` = '5b65dc54-f8fd-48f4-80c3-cc9af9f4884d'