app/Modules/Admin/Target/Controllers/TargetController.php

    public function index()
    {
        $data = [
            'data_user'   => $this->data_user,
            'role_login'  => $this->data_user->role,
            'menu'        => 'Monitoring Perpajakan',
            'fiture'      => 'Input Target',
            'title'       => 'Target Pajak',
            'jenis_pajak' => $this->jenisPajakModel
                ->orderBy('nama_pajak', 'ASC')
                ->findAll(),
---
SELECT *
FROM `jenis_pajak`
ORDER BY `nama_pajak` ASC

    public function data()
    {
        $tahun = $this->request->getGet('tahun');

        $builder = $this->targetModel
            ->select('
                target.*,
                jenis_pajak.nama_pajak,
                jenis_pajak.kode
            ')
            ->join(
                'jenis_pajak',
                'jenis_pajak.id = target.jenis_id',
                'left'
            );

        if (!empty($tahun)) {
            $builder->where('target.tahun', $tahun);
        }

        $data = $builder
            ->orderBy('target.tahun', 'DESC')
            ->orderBy('jenis_pajak.nama_pajak', 'ASC')
            ->orderBy('target.bulan', 'ASC')
            ->findAll();
---
SELECT `target`.*, `jenis_pajak`.`nama_pajak`, `jenis_pajak`.`kode`
FROM `target`
LEFT JOIN `jenis_pajak` ON `jenis_pajak`.`id` = `target`.`jenis_id`
WHERE `target`.`tahun` = '2026'
ORDER BY `target`.`tahun` DESC, `jenis_pajak`.`nama_pajak` ASC, `target`.`bulan` ASC